[
{
    "name": "GLANCE",
    "image": "project-info/img/glanceScreenShot3.png",
    "data": [
    {
        "title": "Summary",
        "content": "Coordination platform for meetups and appointments by seeing other users’ locations."
    },
    {
        "title": "Features",
        "content": "-Built interactive frontend with JavaScript, ReactJS, React Native and native-base library with Redux, allowing users to create meetups by searching for locations and inviting friends to join. \n \n -Architected and deployed RESTful API with Node.js and Express with data persistence using PostgreSQL DB; deployed backend to AWS using EC2 and Elastic Beanstalk.\n \n-Implemented Google Maps, Google Directions, and Geocoding API’s and Socket.io to update locations in real time, allowing users to see exactly how far away friends are from destination.\n \n-Used TDD with Jest and Enzyme for front end and supertests for REST API calls, achieving 80% code coverage."
    },
    {
        "title": "Tech Used",
        "content": "Javascript \n \n React\n \nReact Native\n \nNode/Express\n \nPostgres\n \nChai\n \nMocha"
    }]
},
{
    "name": "JMAIL",
    "image": "project-info/img/inbox.png",
    "data": [
    {
        "title": "Summary",
        "content": "Web-based email client streamlined for efficient sending and reading of messages."
    },
    {
        "title": "Features",
        "content": "-Designed and built mock email web system using JavaScript, ReactJS, Redux, HTML5, CSS3 and Materialize.\n \n -Integrated Airtable API as backend to save messages, saving $60 / year on monthly server and database fees."
    },
    {
        "title": "Tech Used",
        "content": "Javascript \n \n React \n \nRedux \n \nChai\n \nMocha"
    }]
},
{
    "name": "JASONS RESTAURANT",
    "image": "project-info/img/restaurantScreenShot1.png",
    "data": [
    {
        "title": "Summary",
        "content": "Restaurant ordering web application for choosing items and validating orders."
    },
    {
        "title": "Features",
        "content": "-Designed and built dynamic, responsive mock restaurant ordering web system using JavaScript, ReactJS, Redux, HTML5, CSS3 and Materialize."
    },
    {
        "title": "Tech Used",
        "content": "Javascript \n \n React \n \nRedux \n \nChai\n \nMocha"
    }]
},
{
    "name": "NBA PLAYER COMPARISON",
    "image": "project-info/img/playerComparisonScreenShot1.png",
    "data": [
    {
        "title": "Summary",
        "content": "Tool for basketball fans to compare any two current or former NBA players."
    },
    {
        "title": "Features",
        "content": "-Architected system using JavaScript, HTML5, CSS3, and ElementX, integrating DomParser to parse HTML5 from basketballreference.com, retrieving statistics on points, rebounds and assists per game."
    },
    {
        "title": "Tech Used",
        "content": "Javascript \n \n ElementX"
    }]
},
{
    "name": "FOOD LOC",
    "image": "project-info/img/foodLoc.png",
    "data": [
    {
        "title": "Summary",
        "content": "Landing page for a start-up called FoodLoc.  FoodLoc’s mission is to connect people and the delicacy of food - the location around them has to offer in easy, fast and simple manner."
    },
    {
        "title": "Features",
        "content": ""
    },
    {
        "title": "Tech Used",
        "content": "Javascript \n \n jQuery"
    }]
},
{
    "name": "TOP GOOGLE SEARCH",
    "image": "project-info/img/topGoogleSearch.png",
    "data": [
        {
            "title": "Summary",
            "content": "Web-based client that returns top 3 google searches along with an image."
        },
        {
            "title": "Features",
            "content": "-Uses google api to return top three google searches"
        },

        {
            "title": "Tech Used",
            "content": "Javascript \n \n React\n \n Redux \n \n Google Search API"
        }
    ]
}]